let digit = 25; // целое число
let fract = 25.03; // дробное число
let exp = 2e10; // экспоненциальная запись большого числа 20000000000
let expSmall = 2e-3; //  маленькое число 0.002
let expFract = 1.25e3; // экспоненциальная запись дробного числа 1250
let expFractSmall = 1.25e3; // экспоненциальная запись маленького числа 0.00125
let fract1 = 25.; // 25 - целая часть, 0 - дробная
let fract2 = .25; // 0 - целая часть, 25 - дробная

let dec = 9;
let bin = 0b1001; // двоичное число 9

let oct = 0o10; // восьмеричное число 8

let x = 0x1b // шестнадцатиричное число 27