// Популярные функции math

// Положительное значение числа
Math.abs(-29); // 20
Math.abs(23); // 23

// Округление
Math.round(3.4); // 4, математическое округление
Math.round(3.2); // 3
Math.round(3.5); // 4
Math.floor(3.9); // 3, округление вниз
Math.ceil(3.2); // 4, округление вверх

// Наибольшее и наименьшее число
Math.max(10, 1, -40, 12, 5); // 12, наиболшее из чисел
Math.min(10, 1, -40, 12, 5); // -40, наименшее из чисел

// Возведение в степень
Math.pow(10, 3); // 10^3, 1000
10 ** 3; // аналогичная запись , но моожет не везде подерживаться
Math.sqrt(16); // 4, квадратный корень числа
Math.pow(16, 0.5); // 4, тоже квадратный корень

// Случайные числа
Math.random(); // случайное дробное число от 0 до 1
Math.round(Math.random() * 100); // случайное число от 0 до 100
Math.round(Math.random() * 70) + 50; // случайное число от 50 до 120