/*Задание 1
Цель задания
Практика сложных условий. Научиться искать подстроку внутри строки.
Задание
В переменную password запишите строку с любым произвольным паролем. 
Проверьте надёжность пароля. Пароль является надёжным, когда в нём есть хотя бы четыре символа, 
а также есть хотя бы один из символов '-', '_'. 
Выведите в консоль сообщения «Пароль надёжный» или «Пароль недостаточно надёжный».
Проверка результата
Для проверки запустите код с разными вариантами надёжных и ненадёжных паролей. Примеры корректный паролей:
1234-
4321_
qaz-xsw
_zxd
Примеры некорректных паролей:
_-a
qaz
_-3
123456789
Пароль является надёжным, когда в нём есть хотя бы 4 символа, 
среди которых есть хотя бы один из символов «-», «_».
*/

let password = ['1234-', '4321_', 'qaz-xsw', '_zxd', '_-a', 'qaz', '_-3', '123456789']

for (let pass of password) {
    if (pass.length < 4){
        console.log('Пароль недостаточно надёжный');
        continue
    }
    if (pass.includes('-') || pass.includes('_')){
        console.log('Пароль надёжный');
    }else {
        console.log('Пароль недостаточно надёжный');
    }
}


/*Задание 2
Цель задания
Узнать, как преобразовывать строку в верхний/нижний регистр. 
Узнать, как извлекать произвольные куски из строки.
Задание
В переменных name, surname написаны имя и фамилия человека.
При этом в строках беспорядок с большими и маленькими буквами, и нужно привести строки в порядок. 
Для этого первые буквы имени и фамилии приведите к верхнему регистру, а оставшиеся буквы — к нижнему. 
Запишите результат в новые переменные и выведите их значения с помощью console.log. 
С помощью тернарных операторов и console.log выведите сообщение «Имя было преобразовано» 
или «Имя осталось без изменений» для имени и фамилии в зависимости от того, 
были ли исходные строки равны преобразованным.

Проверка результата
Для любых имени и фамилии в любом регистре должны выводиться такие же имя и фамилия, 
но первая буква у них большая, а все остальные — маленькие.
*/

let name = 'Aleksei'
let surname = 'koChnOV'

let truName = name[0].toUpperCase() + name.substr(1).toLowerCase()
let truSurname = surname[0].toUpperCase() + surname.substr(1).toLowerCase()
console.log(truName, truSurname);
console.log(name === truName ? 'Имя осталось без изменений' : 'Имя было преобразовано');
console.log(surname === truSurname ? 'Фамилия осталось без изменений' : 'Фамилия была преобразована');