/*Задание 1
Напишите функцию filter() в filter-black-list.js, которая создаёт массив email-адресов, 
не попавших в чёрный список. В качестве аргументов функция должна принимать: 
массив строк с исходными email адресами, массив строк с email адресами в чёрном списке.

В конце файла с кодом домашнего задания напишите конструкцию export default {название функции}, 
чтобы была возможность автоматической проверки получившейся функции.
*/

function filter(ar, arFalse) {     // Функция создает массив с эмейлами, если они не входят в черный список 
    let trueArrey = [];

    for (let password of ar) {
        if (!arFalse.includes(password)){
            trueArrey.push(password);
        }
    }

    return trueArrey;
}


// Функция вызывается с массивом и черным списком
console.log(filter(['zalupa@mail.ru', 'open@gmail.com'], ['zalupa@mail.ru']));


/*Задание 2
Напишите функцию calculate() в cart-total.js, которая вычисляет и возвращает стоимость корзины 
товаров после применения всех скидок. В качестве аргументов функция принимает 3 параметра:

Общая сумма корзины
Количество товаров в корзине
Промокод (по умолчанию null)
Правила и порядок (порядок важен!) начисления скидок:

Если промокод равен 'ДАРИМ300', то из суммы вычитается 300 рублей. При этом если сумма меньше 300 рублей, 
то итоговая стоимость будет 0.
При количестве товаров в корзине ≥10 применяется скидка 5% ко всей сумме
При сумме, превышающей 50 000, применяется скидка 20% к сумме превышения 
(то есть к разнице суммы корзины и 50 000)
Если промокод равен 'СКИДКА15', то ко всей сумме применяется скидка 15%, но только если сумма ≥20 000
Каждая следующая скидка должна проверяться и применяться к сумме после применения предыдущих скидок.
*/

function calculate(a, b, c = null) {  // Функция вычесляет скидку
    let basketAmount = a // Общая сумма корзины
    let basketGoods = b  // Количество товаров в корзине
    let promoCode = c    // Промокод (по умолчанию null)
    
    if (promoCode === 'ДАРИМ300') { // Если промокод равен 'ДАРИМ300'
        if (basketAmount < 300) {
            basketAmount = 0
        }else {
            basketAmount -= 300
        }
    }

    if (basketGoods >= 10) {       // При количестве товаров в корзине ≥10
        basketAmount = (basketAmount / 100) * 5
    }

    if (basketAmount > 50000) {     // При сумме, превышающей 50 000
        let res = ((basketAmount - 50000) / 100) * 20
        basketAmount -= res
    }

    if (promoCode === 'СКИДКА15') {    // Если промокод равен 'СКИДКА15'
        if (basketAmount >= 20000) {
            basketAmount = (basketAmount / 100) * 15
        }
    }

    return basketAmount
}


